; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v6 ?v7)
             (pred_6 ?v5 ?v12)
             (pred_3 ?v6 ?v12)
             (pred_9 ?v10 ?v6 )
	     (pred_5 ?v6)
             (pred_10 ?v1)
             (pred_2 ?v5)
             (pred_1 ?v12)
             (pred_11 ?v6)
             (pred_7 ?v5)
             (pred_4 ?v6)
             (pred_12 ))



(:action op_4
:parameters (?v13 ?v4 ?v9 ?v3)
:precondition (and (pred_10 ?v13) (pred_10 ?v4) (pred_2 ?v9) (pred_1 ?v3)
          (pred_8 ?v13 ?v4) (pred_6 ?v9 ?v3)
                   (pred_3 ?v4 ?v3) (pred_5 ?v13) 
                   (pred_11 ?v4) (pred_7 ?v9))
:effect (and  (pred_4 ?v4) (not (pred_11 ?v4))))


(:action op_2
:parameters (?v13 ?v11)
:precondition (and (pred_10 ?v13) (pred_10 ?v11)
               (pred_5 ?v13) (pred_8 ?v13 ?v11) (pred_4 ?v11))
:effect (and (pred_5 ?v11) (not (pred_5 ?v13))))

(:action op_3
:parameters (?v13 ?v9)
:precondition (and (pred_10 ?v13) (pred_2 ?v9) 
                  (pred_5 ?v13) (pred_9 ?v9 ?v13) (pred_12 ))
:effect (and (pred_7 ?v9)
   (not (pred_9 ?v9 ?v13)) (not (pred_12 ))))


(:action op_5
:parameters (?v13 ?v8 ?v2)
:precondition (and (pred_10 ?v13) (pred_2 ?v8) (pred_2 ?v2)
                  (pred_5 ?v13) (pred_7 ?v2) (pred_9 ?v8 ?v13))
:effect (and (pred_7 ?v8) (pred_9 ?v2 ?v13)
        (not (pred_7 ?v2)) (not (pred_9 ?v8 ?v13))))

(:action op_1
:parameters (?v13 ?v9)
:precondition (and (pred_10 ?v13) (pred_2 ?v9) 
                  (pred_5 ?v13) (pred_7 ?v9))
:effect (and (pred_12 ) (pred_9 ?v9 ?v13) (not (pred_7 ?v9)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_03 obj_26 obj_05 obj_29 obj_18 obj_06 obj_04 obj_24 obj_20 obj_13 obj_01 obj_17 obj_21 obj_07 obj_30 obj_10 obj_12 obj_19 obj_08 obj_16 obj_23 obj_02 obj_22 obj_25
    obj_14 obj_27 obj_28
    obj_31 obj_09 obj_15
    )

    (:init
       (pred_12)

       (pred_10 obj_11)
       (pred_10 obj_03)
       (pred_10 obj_26)
       (pred_10 obj_05)
       (pred_10 obj_29)
       (pred_10 obj_18)
       (pred_10 obj_06)
       (pred_10 obj_04)
       (pred_10 obj_24)
       (pred_10 obj_20)
       (pred_10 obj_13)
       (pred_10 obj_01)
       (pred_10 obj_17)
       (pred_10 obj_21)
       (pred_10 obj_07)
       (pred_10 obj_30)
       (pred_10 obj_10)
       (pred_10 obj_12)
       (pred_10 obj_19)
       (pred_10 obj_08)
       (pred_10 obj_16)
       (pred_10 obj_23)
       (pred_10 obj_02)
       (pred_10 obj_22)
       (pred_10 obj_25)
       (pred_1 obj_14)
       (pred_1 obj_27)
       (pred_1 obj_28)
       (pred_2 obj_31)
       (pred_2 obj_09)
       (pred_2 obj_15)

       (pred_8 obj_11 obj_18)
       (pred_8 obj_11 obj_03)
       (pred_8 obj_03 obj_06)
       (pred_8 obj_03 obj_26)
       (pred_8 obj_03 obj_11)
       (pred_8 obj_26 obj_04)
       (pred_8 obj_26 obj_05)
       (pred_8 obj_26 obj_03)
       (pred_8 obj_05 obj_24)
       (pred_8 obj_05 obj_29)
       (pred_8 obj_05 obj_26)
       (pred_8 obj_29 obj_20)
       (pred_8 obj_29 obj_05)
       (pred_8 obj_18 obj_13)
       (pred_8 obj_18 obj_06)
       (pred_8 obj_18 obj_11)
       (pred_8 obj_06 obj_01)
       (pred_8 obj_06 obj_04)
       (pred_8 obj_06 obj_03)
       (pred_8 obj_06 obj_18)
       (pred_8 obj_04 obj_17)
       (pred_8 obj_04 obj_24)
       (pred_8 obj_04 obj_26)
       (pred_8 obj_04 obj_06)
       (pred_8 obj_24 obj_21)
       (pred_8 obj_24 obj_20)
       (pred_8 obj_24 obj_05)
       (pred_8 obj_24 obj_04)
       (pred_8 obj_20 obj_07)
       (pred_8 obj_20 obj_29)
       (pred_8 obj_20 obj_24)
       (pred_8 obj_13 obj_30)
       (pred_8 obj_13 obj_01)
       (pred_8 obj_13 obj_18)
       (pred_8 obj_01 obj_10)
       (pred_8 obj_01 obj_17)
       (pred_8 obj_01 obj_06)
       (pred_8 obj_01 obj_13)
       (pred_8 obj_17 obj_12)
       (pred_8 obj_17 obj_21)
       (pred_8 obj_17 obj_04)
       (pred_8 obj_17 obj_01)
       (pred_8 obj_21 obj_19)
       (pred_8 obj_21 obj_07)
       (pred_8 obj_21 obj_24)
       (pred_8 obj_21 obj_17)
       (pred_8 obj_07 obj_08)
       (pred_8 obj_07 obj_20)
       (pred_8 obj_07 obj_21)
       (pred_8 obj_30 obj_16)
       (pred_8 obj_30 obj_10)
       (pred_8 obj_30 obj_13)
       (pred_8 obj_10 obj_23)
       (pred_8 obj_10 obj_12)
       (pred_8 obj_10 obj_01)
       (pred_8 obj_10 obj_30)
       (pred_8 obj_12 obj_02)
       (pred_8 obj_12 obj_19)
       (pred_8 obj_12 obj_17)
       (pred_8 obj_12 obj_10)
       (pred_8 obj_19 obj_22)
       (pred_8 obj_19 obj_08)
       (pred_8 obj_19 obj_21)
       (pred_8 obj_19 obj_12)
       (pred_8 obj_08 obj_25)
       (pred_8 obj_08 obj_07)
       (pred_8 obj_08 obj_19)
       (pred_8 obj_16 obj_23)
       (pred_8 obj_16 obj_30)
       (pred_8 obj_23 obj_02)
       (pred_8 obj_23 obj_10)
       (pred_8 obj_23 obj_16)
       (pred_8 obj_02 obj_22)
       (pred_8 obj_02 obj_12)
       (pred_8 obj_02 obj_23)
       (pred_8 obj_22 obj_25)
       (pred_8 obj_22 obj_19)
       (pred_8 obj_22 obj_02)
       (pred_8 obj_25 obj_08)
       (pred_8 obj_25 obj_22)
       (pred_11 obj_26)
       (pred_11 obj_16)
       (pred_11 obj_19)
       (pred_3  obj_26 obj_14)
       (pred_3  obj_16 obj_27)
       (pred_3  obj_19 obj_28)
       (pred_4 obj_11)
       (pred_4 obj_03)
       (pred_4 obj_05)
       (pred_4 obj_29)
       (pred_4 obj_18)
       (pred_4 obj_06)
       (pred_4 obj_04)
       (pred_4 obj_24)
       (pred_4 obj_20)
       (pred_4 obj_13)
       (pred_4 obj_01)
       (pred_4 obj_17)
       (pred_4 obj_21)
       (pred_4 obj_07)
       (pred_4 obj_30)
       (pred_4 obj_10)
       (pred_4 obj_12)
       (pred_4 obj_08)
       (pred_4 obj_23)
       (pred_4 obj_02)
       (pred_4 obj_22)
       (pred_4 obj_25)

       (pred_6  obj_31 obj_14)
       (pred_6  obj_09 obj_27)
       (pred_6  obj_15 obj_28)
       (pred_9 obj_31 obj_10)
       (pred_9 obj_09 obj_20)
       (pred_9 obj_15 obj_05)
       (pred_5 obj_24)
    )

    (:goal (and
       (pred_9 obj_31 obj_13)
       (pred_9 obj_15 obj_01)
    ))
(:constraints
  (always (not (pred_5 obj_04)))
)
)

; plan
1. (op_2 obj_24 obj_21)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_21)
   goals met: 0 of 2
2. (op_2 obj_21 obj_17)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_17)
   goals met: 0 of 2
3. (op_2 obj_17 obj_01)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_01)
   goals met: 0 of 2
4. (op_2 obj_01 obj_10)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_10)
   goals met: 0 of 2
5. (op_3 obj_10 obj_31)
   deleted: (pred_9 obj_31 obj_10) (pred_12)
   added: (pred_7 obj_31)
   goals met: 0 of 2
6. (op_2 obj_10 obj_01)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_01)
   goals met: 0 of 2
7. (op_2 obj_01 obj_13)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_13)
   goals met: 0 of 2
8. (op_1 obj_13 obj_31)
   deleted: (pred_7 obj_31)
   added: (pred_12) (pred_9 obj_31 obj_13)
   goals met: 1 of 2
9. (op_2 obj_13 obj_01)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_01)
   goals met: 1 of 2
10. (op_2 obj_01 obj_17)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_17)
   goals met: 1 of 2
11. (op_2 obj_17 obj_21)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_21)
   goals met: 1 of 2
12. (op_2 obj_21 obj_24)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_24)
   goals met: 1 of 2
13. (op_2 obj_24 obj_05)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_05)
   goals met: 1 of 2
14. (op_3 obj_05 obj_15)
   deleted: (pred_9 obj_15 obj_05) (pred_12)
   added: (pred_7 obj_15)
   goals met: 1 of 2
15. (op_2 obj_05 obj_24)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_24)
   goals met: 1 of 2
16. (op_2 obj_24 obj_21)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_21)
   goals met: 1 of 2
17. (op_2 obj_21 obj_17)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_17)
   goals met: 1 of 2
18. (op_2 obj_17 obj_01)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_01)
   goals met: 1 of 2
19. (op_1 obj_01 obj_15)
   deleted: (pred_7 obj_15)
   added: (pred_12) (pred_9 obj_15 obj_01)
   goals met: 2 of 2
